       program-id. ENEB010 as "ENEB010".

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.


           goback.

       end program ENEB010.
